app/Livewire/Reports/DischargeReport.php

select * from `discharges` where `updated_at` between '2026-04-01 00:00:00' and '2026-04-17 23:59:59' order by `updated_at` desc
---
    public function loadData()
    {
        $this->data = Discharge::whereBetween('updated_at', [
            $this->startDate . ' 00:00:00',
            $this->endDate . ' 23:59:59',
        ])
        ->when($this->machine_name, function ($query) {
                return $query->where('machine_name', $this->machine_name);
            })
        ->when($this->status_cycle, function ($query) {
                return $query->where('status_cycle', $this->status_cycle);
            })
        ->when($this->validation_biologic, function ($query) {
                return $query->where('validation_biologic', $this->validation_biologic);
            })
            ->orderBy('updated_at', 'desc')->get()->toArray();