app/Livewire/Reports/ReceptionReport.php

    public function render()
    {
        return view('livewire.reports.receptions-report', [
            'data' => $this->data,
            'selectedItems' => $this->selectedItems,
            'selectAll' => $this->selectAll,
        ]);
---
select `receptions`.`id` from `receptions` where `receptions`.`updated_at` between '2025-04-01 00:00:00' and '2026-04-17 23:59:59'