app/Livewire/Reports/ReceptionReport.php

    public function loadData()
    {
        // Cargar datos con la relación de detalles y contar los detalles
        $receptions = Reception::with('receptionDetails') // Asumiendo que tienes la relación definida
            ->whereBetween('updated_at', [
                $this->startDate . ' 00:00:00',
                $this->endDate . ' 23:59:59',
            ])
            ->when($this->area, function ($query) {
                return $query->where('area', $this->area);
            })
            ->when($this->status, function ($query) {
                return $query->where('status', $this->status);
            })
            ->orderBy('updated_at', 'desc')
            ->get();

        // Convertir a array y agregar el conteo de detalles
        $this->data = $receptions->map(function ($reception) {
            $receptionArray = $reception->toArray();
            $receptionArray['details_count'] = $reception->receptionDetails->count();
            return $receptionArray;
        })->toArray();
---
select count(*) as aggregate from `reception_details` where `reception_id` in (select `receptions`.`id` from `receptions` where `receptions`.`updated_at` between '2026-04-01 00:00:00' and '2026-04-17 23:59:59')
select count(`receptions`.`id`) as aggregate from `receptions` where `receptions`.`updated_at` between '2026-04-01 00:00:00' and '2026-04-17 23:59:59'
select * from `receptions` where `updated_at` between '2026-04-01 00:00:00' and '2026-04-17 23:59:59' order by `updated_at` desc