Modules/Reception/Http/Controllers/PrinterController.php

    public function printerReceptiona4(Int $id)
    {

        $reception = Reception::where('id', $id)->first();

        $receptionDetails = receptionDetails::with('product')
            ->where('reception_id', $reception->id)
            ->orderBy('id', 'DESC')
            ->get()->first();

        $institute = Institute::all()->first();
        $instituteMedia = $institute->getFirstMedia('institutes');
        $urlImage = $instituteMedia ? $instituteMedia->getPath() : public_path('images/fallback_product_image.png');
        $Image = file_exists($urlImage) ? file_get_contents($urlImage) : file_get_contents(public_path('images/fallback_product_image.png'));
        $base64 = base64_encode($Image);
        $dataUrl = 'data:image/jpeg;base64,' . $base64;

        $setting = Setting::all()->first();
---
select * from `receptions` where `id` = 6562 limit 1
select * from `products` where `products`.`id` in (9)
select * from `institutes`
select * from `settings`