Modules/Reception/Http/Controllers/ReceptionPreparationController.php

insert into `prelavado_detalles` (`reception_id`, `product_id`, `reception_reference`, `product_name`, `product_code`, `product_quantity`, `product_patient`, `product_info`, `product_outside_company`, `product_area`, `product_type_process`, `updated_at`, `created_at`) values (6563, 4, 'ING-06563', 'ADAPTADORES DE UROLOGIA (3)', 'V4', 3, null, null, null, 'QUIROFANO', 'Baja Temperatura', '2026-05-17 21:03:12', '2026-05-17 21:03:12')
select * from `prelavado_detalles` where (`reception_id` = 6563 and `product_id` = 4) limit 1
---
    public function __invoke(Reception $reception)
    {
        abort_if(Gate::denies('create_reception_preparations'), 403);

        $reception_details = $reception->receptionDetails;

        // Separar productos: sin lavado van a preparación, con lavado van a prelavado
        $para_preparacion = $reception_details->where('product_lavado', false);
        $para_prelavado   = $reception_details->where('product_lavado', true);

        // Guardar en prelavado_detalles los que requieren lavado previo
        foreach ($para_prelavado as $detalle) {
            PrelavadoDetalle::updateOrCreate(
                [
                    'reception_id' => $reception->id,
                    'product_id'   => $detalle->product_id,
                ],
                [
                    'reception_reference'    => $reception->reference,
                    'product_name'           => $detalle->product_name,
                    'product_code'           => $detalle->product_code,
                    'product_quantity'       => $detalle->product_quantity,
                    'product_patient'        => $detalle->product_patient,
                    'product_info'           => $detalle->product_info,
                    'product_outside_company'=> $detalle->product_outside_company,
                    'product_area'           => $detalle->product_area,
                    'product_type_process'   => $detalle->product_type_process,
                ]
            );