Modules/Reception/Http/Controllers/ReceptionController.php

insert into `receptions` (`reference`, `operator`, `delivery_staff`, `area`, `status`, `note`, `total_amount`, `updated_at`, `created_at`) values ('ING-06563', 'Admin', 'p', 'QUIROFANO', 'Registrado', null, '6.00', '2026-05-17 21:03:05', '2026-05-17 21:03:05')
insert into `reception_details` (`reception_id`, `product_id`, `product_name`, `product_code`, `product_quantity`, `price`, `unit_price`, `sub_total`, `product_patient`, `product_info`, `product_outside_company`, `product_area`, `product_type_dirt`, `product_type_process`, `product_state_rumed`, `product_lavado`, `updated_at`, `created_at`) values (6563, 4, 'ADAPTADORES DE UROLOGIA (3)', 'V4', 3, 1, 1, 3, null, null, null, 'QUIROFANO', 'CRITICO', 'Baja Temperatura', 'BUENO', 1, '2026-05-17 21:03:05', '2026-05-17 21:03:05')
---
    public function store(StoreReceptionRequest $request)
    {
        DB::transaction(function () use ($request) {
            $reception = Reception::create([


                'reference' => $request->reference,
                'operator' => $request->operator,
                'delivery_staff' => $request->delivery_staff,
                'area' => $request->area,
                'status' => $request->status,
                'note' => $request->note,
                'total_amount' => $request->total_amount,  // se añade


            ]);

            foreach (Cart::instance('reception')->content() as $cart_item) {
                ReceptionDetails::create([
                    'reception_id' => $reception->id,
                    'product_id' => $cart_item->id,
                    'product_name' => $cart_item->name,
                    'product_code' => $cart_item->options->code,
                    'product_quantity' => $cart_item->qty,
                    'price' => $cart_item->price, // se añade
                    'unit_price' => $cart_item->options->unit_price, // se añade
                    'sub_total' => $cart_item->options->sub_total, // se añade
                    'product_patient' => $cart_item->options->product_patient,
                    'product_info' => $cart_item->options->product_info,
                    'product_outside_company' => $cart_item->options->product_outside_company,
                    'product_area' => $cart_item->options->product_area,
                    'product_type_dirt' => $cart_item->options->product_type_dirt,
                    'product_type_process' => $cart_item->options->product_type_process,
                    'product_state_rumed' => $cart_item->options->product_state_rumed,
                    'product_lavado' => $cart_item->options->product_lavado ?? false,
                ]);