app/Helpers/helpers.php

select * from `institutes` limit 1
---
    function institutes()
    {
        $institutes = cache()->remember('institutes', 24 * 60, function () {
            return \Modules\Informat\Entities\Institute::firstOrFail();

select * from `settings` limit 1
---
    function settings()
    {
        $settings = cache()->remember('settings', 24 * 60, function () {
            return \Modules\Setting\Entities\Setting::firstOrFail();