Modules/Preparation/Http/Controllers/PreparationController.php

select * from `receptions` where `receptions`.`id` = '6562' limit 1
---
    public function store(StorePreparationRequest $request)
    {
        abort_if(Gate::denies('create_preparations'), 403);

        try {
            DB::beginTransaction();

            $cartContent = Cart::instance(self::CART_INSTANCE)->content();

            // Determinar si viene desde recepción o desde lavado
            $reception      = $request->reception_id      ? Reception::find($request->reception_id)         : null;

insert into `preparations` (`reception_id`, `lavado_id`, `operator`, `note`, `total_amount`, `reference`, `updated_at`, `created_at`) values (6562, null, 'Admin', null, '5', 'PRE-06723', '2026-05-17 21:02:27', '2026-05-17 21:02:27')
update `receptions` set `status` = 'Procesado', `receptions`.`updated_at` = '2026-05-17 21:02:27' where `id` = 6562
---
            }

            // Crear la preparación
            $preparation = Preparation::create([
                'reception_id' => $reception?->id,
                'lavado_id'    => $lavado?->id,
                'operator'     => $request->operator,
                'note'         => $request->note,
                'total_amount' => $request->total_amount ?? 0,
            ]);

            // Actualizar el estado según el origen
            if ($reception) {
                $reception->update(['status' => 'Procesado']);

insert into `preparation_details` (`preparation_id`, `product_id`, `product_name`, `product_quantity`, `price`, `unit_price`, `product_code`, `product_type_process`, `product_state_preparation`, `product_coming_zone`, `product_patient`, `product_outside_company`, `product_area`, `product_info`, `updated_at`, `created_at`) values (6723, 9, 'AJUSTA ALAMBRE ', 5, 1, 1, 'V9', 'Alta Temperatura', 'Disponible', 'Recepcion', null, null, 'QUIROFANO', null, '2026-05-17 21:02:27', '2026-05-17 21:02:27')
---

            // Crear los detalles de la preparación
            foreach ($cartContent as $cart_item) {
                PreparationDetails::create([
                    'preparation_id' => $preparation->id,
                    'product_id' => $cart_item->id,
                    'product_name' => $cart_item->name,
                    'product_quantity' => $cart_item->qty,
                    'price' => $cart_item->price ?? 0,
                    'unit_price' => $cart_item->options->unit_price ?? 0,
                    'product_code' => $cart_item->options->code ?? '',
                    'product_type_process' => $cart_item->options->product_type_process ?? null,
                    'product_state_preparation' => $cart_item->options->product_state_preparation ?? 'Recepcion',
                    'product_coming_zone' => $cart_item->options->product_coming_zone ?? null,
                    'product_patient' => $cart_item->options->product_patient ?? null,
                    'product_outside_company' => $cart_item->options->product_outside_company ?? null,
                    'product_area' => $cart_item->options->product_area ?? null,
                    'product_info' => $cart_item->options->product_info ?? null,
                ]);