Modules/Reports/Http/Controllers/ReceptionPrintController.php

    private function generatePdf(array $ids, array $filters): mixed
    {
        try {
            set_time_limit(120);
            ini_set('memory_limit', '256M');

            $itemCount = count($ids);
            $groupBy   = $filters['groupBy'] ?? 'date';

            Log::info("PDF: {$itemCount} recepciones, groupBy={$groupBy}");

            // ── 1. Datos institucionales ──────────────────────────────────
            $institute  = Institute::first();
            $setting    = Setting::first();
---
select * from `institutes` limit 1
select * from `settings` limit 1