Modules/Testbd/Http/Controllers/PrinterTbdController.php

select * from `testbds` where `id` = 349 limit 1
select * from `institutes`
select * from `settings`
---
  public function printerTestbdA4(Int $id)
  {
    $testbd = Testbd::where('id', $id)->first();
    $institute = Institute::all()->first();
    $dataUrl = null;
    $instituteMedia = $institute->getFirstMedia('institutes');
    if ($instituteMedia && file_exists($instituteMedia->getPath())) {
        $dataUrl = 'data:image/jpeg;base64,' . base64_encode(file_get_contents($instituteMedia->getPath()));
    }

    $setting = Setting::all()->first();