app/Livewire/SearchProduct.php

select * from `products` where `area` like '% %' or `product_code` like '% %' or `product_name` like '% %' limit 10
---
    public function updatedQuery()
    {
        $this->search_results = Product::where('area', 'like', '%' . $this->query . '%')
            ->orWhere('product_code', 'like', '%' . $this->query . '%')
            ->orWhere('product_name', 'like', '%' . $this->query . '%')
            ->take($this->how_many)->get();