app/Http/Controllers/HomeController.php

    public function testBowiesChart()
    {
        abort_if(!request()->ajax(), 404);
        $dates = collect();
        foreach (range(-6, 0) as $i) {
            $date = Carbon::now()->addMonths($i)->format('m-Y');
            $dates->put($date, 0);
        }

        $date_range = Carbon::today()->subYear()->format('Y-m-d');

        $Negativos = Testvacuum::where('updated_at', '>=', $date_range)
            ->where('validation_vacuum', 'Correcto')
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');

        $Positivos = Testvacuum::where('updated_at', '>=', $date_range)
            ->where('validation_vacuum', 'Falla')
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');

        $NegativosTBD = Testbd::where('updated_at', '>=', $date_range)
            ->where('validation_bd', 'Correcto')
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');

        $PositivosTBD = Testbd::where('updated_at', '>=', $date_range)
            ->where('validation_bd', 'Falla')
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');
---
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `testvacuums` where `updated_at` >= '2025-06-08' and `validation_vacuum` = 'Correcto' group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `testvacuums` where `updated_at` >= '2025-06-08' and `validation_vacuum` = 'Falla' group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `testbds` where `updated_at` >= '2025-06-08' and `validation_bd` = 'Correcto' group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `testbds` where `updated_at` >= '2025-06-08' and `validation_bd` = 'Falla' group by `month` order by `month` asc

    public function currentMonthChart()
    {
        abort_if(!request()->ajax(), 404);

        $date_range = Carbon::today()->subYear()->format('Y-m-d');

        $currentMonthTestbdoks = Testbd::where('validation_bd', 'Correcto')
            ->where('updated_at', '>=', $date_range)
            ->count();
        $currentMonthTestbdfails = Testbd::where('validation_bd', 'Falla')
            ->where('updated_at', '>=', $date_range)
            ->count();
        $currentMonthTestvacuumoks = Testvacuum::where('validation_vacuum', 'Correcto')
            ->where('updated_at', '>=', $date_range)
            ->count();
        $currentMonthTestvacuumfails = Testvacuum::where('validation_vacuum', 'Falla')
            ->where('updated_at', '>=', $date_range)
            ->count();
---
select count(*) as aggregate from `testbds` where `validation_bd` = 'Correcto' and `updated_at` >= '2025-05-17'
select count(*) as aggregate from `testbds` where `validation_bd` = 'Falla' and `updated_at` >= '2025-05-17'
select count(*) as aggregate from `testvacuums` where `validation_vacuum` = 'Correcto' and `updated_at` >= '2025-05-17'
select count(*) as aggregate from `testvacuums` where `validation_vacuum` = 'Falla' and `updated_at` >= '2025-05-17'

    public function ProductionsChart()
    {
        abort_if(!request()->ajax(), 404);

        $dates = collect();
        foreach (range(-6, 0) as $i) {
            $date = Carbon::now()->addMonths($i)->format('m-Y');
            $dates->put($date, 0);
        }


        $date_range = Carbon::today()->subYear()->format('Y-m-d');

        $search_steamok1 = ['machine_name' =>  'MATACHANA', 'machine_type' => 'Autoclave', 'status_cycle' => 'Ciclo Aprobado'];
        $Steam1ok = Discharge::where('updated_at', '>=', $date_range)
            ->where($search_steamok1)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("SUM(total_amount) as total_amount")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('total_amount', 'month');


        $search_steamFail1 = ['machine_name' =>  'MATACHANA', 'machine_type' => 'Autoclave', 'status_cycle' => 'Ciclo Falla'];
        $Steam1fail = Discharge::where('updated_at', '>=', $date_range)
            ->where($search_steamFail1)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("SUM(total_amount) as total_amount")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('total_amount', 'month');

        $search_steamok2 = ['machine_name' => 'CISA', 'machine_type' => 'Autoclave', 'status_cycle' => 'Ciclo Aprobado'];
        $Steam2ok = Discharge::where('updated_at', '>=', $date_range)
            ->where($search_steamok2)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("SUM(total_amount) as total_amount")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('total_amount', 'month');


        $search_steamFail2 = ['machine_name' => 'CISA', 'machine_type' => 'Autoclave', 'status_cycle' => 'Ciclo Falla'];
        $Steam2fail = Discharge::where('updated_at', '>=', $date_range)
            ->where($search_steamFail2)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("SUM(total_amount) as total_amount")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('total_amount', 'month');

        $search_HPOOK = ['machine_name' => 'MATACHANA HPO', 'machine_type' => 'Peroxido', 'status_cycle' => 'Ciclo Aprobado'];
        $HPO_OK = Discharge::where('updated_at', '>=', $date_range)
            ->where($search_HPOOK)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("SUM(total_amount) as total_amount")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('total_amount', 'month');


        $search_HPOFAIL = ['machine_name' => 'MATACHANA HPO', 'machine_type' => 'Peroxido', 'status_cycle' => 'Ciclo Falla'];
        $HPO_FAIL = Discharge::where('updated_at', '>=', $date_range)
            ->where($search_HPOFAIL)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("SUM(total_amount) as total_amount")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('total_amount', 'month');
---
select DATE_FORMAT(updated_at, '%m-%Y') as month, SUM(total_amount) as total_amount from `discharges` where `updated_at` >= '2025-05-17' and (`machine_name` = 'MATACHANA' and `machine_type` = 'Autoclave' and `status_cycle` = 'Ciclo Aprobado') group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, SUM(total_amount) as total_amount from `discharges` where `updated_at` >= '2025-05-17' and (`machine_name` = 'MATACHANA' and `machine_type` = 'Autoclave' and `status_cycle` = 'Ciclo Falla') group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, SUM(total_amount) as total_amount from `discharges` where `updated_at` >= '2025-05-17' and (`machine_name` = 'CISA' and `machine_type` = 'Autoclave' and `status_cycle` = 'Ciclo Aprobado') group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, SUM(total_amount) as total_amount from `discharges` where `updated_at` >= '2025-05-17' and (`machine_name` = 'CISA' and `machine_type` = 'Autoclave' and `status_cycle` = 'Ciclo Falla') group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, SUM(total_amount) as total_amount from `discharges` where `updated_at` >= '2025-05-17' and (`machine_name` = 'MATACHANA HPO' and `machine_type` = 'Peroxido' and `status_cycle` = 'Ciclo Aprobado') group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, SUM(total_amount) as total_amount from `discharges` where `updated_at` >= '2025-05-17' and (`machine_name` = 'MATACHANA HPO' and `machine_type` = 'Peroxido' and `status_cycle` = 'Ciclo Falla') group by `month` order by `month` asc

    public function currentMonthProductionChart()
    {
        abort_if(!request()->ajax(), 404);

        $date_range = Carbon::today()->subYear()->format('Y-m-d');

        $search_steamok1 = ['machine_name' =>  'MATACHANA', 'machine_type' => 'Autoclave', 'status_cycle' => 'Ciclo Aprobado'];
        $search_steamFail1 = ['machine_name' =>  'MATACHANA', 'machine_type' => 'Autoclave', 'status_cycle' => 'Ciclo Falla'];
        $search_steamok2 = ['machine_name' => 'CISA', 'machine_type' => 'Autoclave', 'status_cycle' => 'Ciclo Aprobado'];
        $search_steamFail2 = ['machine_name' => 'CISA', 'machine_type' => 'Autoclave', 'status_cycle' => 'Ciclo Falla'];
        $search_HPOOK = ['machine_name' => 'MATACHANA HPO', 'machine_type' => 'Peroxido', 'status_cycle' => 'Ciclo Aprobado'];
        $search_HPOFAIL = ['machine_name' => 'MATACHANA HPO', 'machine_type' => 'Peroxido', 'status_cycle' => 'Ciclo Falla'];
        $Steam1ok = Discharge::where($search_steamok1)
            ->where('updated_at', '>=', $date_range)
            ->count();
        $Steam1fail = Discharge::where($search_steamFail1)
            ->where('updated_at', '>=', $date_range)
            ->count();
        $Steam2ok = Discharge::where($search_steamok2)
            ->where('updated_at', '>=', $date_range)
            ->count();
        $Steam2fail = Discharge::where($search_steamFail2)
            ->where('updated_at', '>=', $date_range)
            ->count();
        $HPO_OK = Discharge::where($search_HPOOK)
            ->where('updated_at', '>=', $date_range)
            ->count();
        $HPO_FAIL = Discharge::where($search_HPOFAIL)
            ->where('updated_at', '>=', $date_range)
            ->count();
---
select count(*) as aggregate from `discharges` where (`machine_name` = 'MATACHANA' and `machine_type` = 'Autoclave' and `status_cycle` = 'Ciclo Aprobado') and `updated_at` >= '2025-06-08'
select count(*) as aggregate from `discharges` where (`machine_name` = 'MATACHANA' and `machine_type` = 'Autoclave' and `status_cycle` = 'Ciclo Falla') and `updated_at` >= '2025-06-08'
select count(*) as aggregate from `discharges` where (`machine_name` = 'CISA' and `machine_type` = 'Autoclave' and `status_cycle` = 'Ciclo Aprobado') and `updated_at` >= '2025-06-08'
select count(*) as aggregate from `discharges` where (`machine_name` = 'MATACHANA HPO' and `machine_type` = 'Peroxido' and `status_cycle` = 'Ciclo Aprobado') and year(`updated_at`) = '2026'
select count(*) as aggregate from `discharges` where (`machine_name` = 'MATACHANA HPO' and `machine_type` = 'Peroxido' and `status_cycle` = 'Ciclo Aprobado') and `updated_at` >= '2025-06-08'
select count(*) as aggregate from `discharges` where (`machine_name` = 'MATACHANA HPO' and `machine_type` = 'Peroxido' and `status_cycle` = 'Ciclo Falla') and `updated_at` >= '2025-06-08'

    public function ProductionlabelsChart()
    {
        abort_if(!request()->ajax(), 404);
        $dates = collect();
        foreach (range(-6, 0) as $i) {
            $date = Carbon::now()->addMonths($i)->format('m-Y');
            $dates->put($date, 0);
        }
        $date_range = Carbon::today()->subYear()->format('Y-m-d');
        $search_Labelsteam = ['product_type_process' => 'Alta Temperatura'];

        $SteamLabel = LabelqrDetails::where('updated_at', '>=', $date_range)
            ->where($search_Labelsteam)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("SUM(product_quantity) as product_quantity")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('product_quantity', 'month');

        $search_LabelHPO = ['product_type_process' => 'Baja Temperatura'];
        $HPOLabel = LabelqrDetails::where('updated_at', '>=', $date_range)
            ->where($search_LabelHPO)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("SUM(product_quantity) as product_quantity")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('product_quantity', 'month');
---
select DATE_FORMAT(updated_at, '%m-%Y') as month, SUM(product_quantity) as product_quantity from `labelqr_details` where `updated_at` >= '2025-05-17' and (`product_type_process` = 'Alta Temperatura') group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, SUM(product_quantity) as product_quantity from `labelqr_details` where `updated_at` >= '2025-05-17' and (`product_type_process` = 'Baja Temperatura') group by `month` order by `month` asc

    public function ResultProductionChart()
    {
        abort_if(!request()->ajax(), 404);

        $dates = collect();
        foreach (range(-6, 0) as $i) {
            $date = Carbon::now()->addMonths($i)->format('m-Y');
            $dates->put($date, 0);
        }
        $date_range = Carbon::today()->subYear()->format('Y-m-d');

        $Procesados = Labelqr::where('updated_at', '>=', $date_range)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("SUM(total_amount) as total_amount")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('total_amount', 'month');


        $esteril = Discharge::where('updated_at', '>=', $date_range)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("SUM(total_amount) as total_amount")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('total_amount', 'month');
---
select DATE_FORMAT(updated_at, '%m-%Y') as month, SUM(total_amount) as total_amount from `labelqrs` where `updated_at` >= '2025-05-17' group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, SUM(total_amount) as total_amount from `discharges` where `updated_at` >= '2025-05-17' group by `month` order by `month` asc

    public function BiologicChart()
    {
        abort_if(!request()->ajax(), 404);

        $dates = collect();
        foreach (range(-6, 0) as $i) {
            $date = Carbon::now()->addMonths($i)->format('m-Y');
            $dates->put($date, 0);
        }

        $date_range = Carbon::today()->subYear()->format('Y-m-d');
        $Find_Steam_ok = ['machine_type' => 'Autoclave', 'validation_biologic' => 'Correcto'];
        $Biolog_Steam_ok = Discharge::where('updated_at', '>=', $date_range)
            ->where($Find_Steam_ok)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');

        $Find_Steam_fail = ['machine_type' => 'Autoclave', 'validation_biologic' => 'Falla'];
        $Biolog_Steam_fail = Discharge::where('updated_at', '>=', $date_range)
            ->where($Find_Steam_fail)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');

        $Find_HPO_ok = ['machine_type' => 'Peroxido', 'validation_biologic' => 'Correcto'];
        $Biolog_HPO_ok = Discharge::where('updated_at', '>=', $date_range)
            ->where($Find_HPO_ok)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');

        $Find_HPO_fail = ['machine_type' => 'Peroxido', 'validation_biologic' => 'Falla'];
        $Biolog_HPO_fail = Discharge::where('updated_at', '>=', $date_range)
            ->where($Find_HPO_fail)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');
---
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `discharges` where `updated_at` >= '2025-05-17' and (`machine_type` = 'Autoclave' and `validation_biologic` = 'Correcto') group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `discharges` where `updated_at` >= '2025-05-17' and (`machine_type` = 'Autoclave' and `validation_biologic` = 'Falla') group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `discharges` where `updated_at` >= '2025-05-17' and (`machine_type` = 'Peroxido' and `validation_biologic` = 'Correcto') group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `discharges` where `updated_at` >= '2025-05-17' and (`machine_type` = 'Peroxido' and `validation_biologic` = 'Falla') group by `month` order by `month` asc

    public function CentralChart()
    {
        abort_if(!request()->ajax(), 404);

        $dates = collect();
        foreach (range(-6, 0) as $i) {
            $date = Carbon::now()->addMonths($i)->format('m-Y');
            $dates->put($date, 0);
        }

        $date_range = Carbon::today()->subYear()->format('Y-m-d');
        $Find_Reception = ['machine_type' => 'Autoclave', 'validation_biologic' => 'Correcto'];
        $Reception = Reception::where('updated_at', '>=', $date_range)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');

        $Find_Sterilized = ['machine_type' => 'Autoclave', 'validation_biologic' => 'Falla'];
        $Labelqr = Labelqr::where('updated_at', '>=', $date_range)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');

        $Find_Expedition = ['machine_type' => 'Peroxido', 'validation_biologic' => 'Correcto'];
        $Expedition = Expedition::where('updated_at', '>=', $date_range)
            ->select([
                DB::raw("DATE_FORMAT(updated_at, '%m-%Y') as month"),
                DB::raw("count('*') as count")
            ])
            ->groupBy('month')->orderBy('month')
            ->get()->pluck('count', 'month');
---
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `receptions` where `updated_at` >= '2025-06-08' group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `labelqrs` where `updated_at` >= '2025-06-08' group by `month` order by `month` asc
select DATE_FORMAT(updated_at, '%m-%Y') as month, count('*') as count from `expeditions` where `updated_at` >= '2025-06-08' group by `month` order by `month` asc