Modules/Preparation/Entities/Preparation.php

select max(`id`) as aggregate from `preparations`
---
    public static function boot() {
        parent::boot();

        static::creating(function ($model) {
            $number = Preparation::max('id') + 1;