Modules/Reception/Entities/Reception.php

select count(*) as aggregate from `reception_details` where `reception_details`.`reception_id` = 6186 and `reception_details`.`reception_id` is not null
---
    public function getDetailsCountAttribute()
{
    return $this->receptionDetails()->count();

select max(`id`) as aggregate from `receptions`
---
    public static function boot() {
        parent::boot();

        static::creating(function ($model) {
            $number = Reception::max('id') + 1;