Modules/Setting/Http/Controllers/SettingController.php

select * from `settings` limit 1
---
    public function index()
    {
        abort_if(Gate::denies('access_settings'), 403);

        $settings = Setting::firstOrFail();

select * from `settings` limit 1
---
    public function update(StoreSettingsRequest $request, Setting $settings)
    {

        DB::transaction(function () use ($request) {

            Setting::FirstorFail()->update([
                'company_name' => $request->company_name,
                'company_email' => $request->company_email,
                'company_phone' => $request->company_phone,
                'notification_email' => $request->notification_email,
                'company_address' => $request->company_address,

            ]);

            if ($request->has('document')) {
                $setting       = Setting::firstOrFail();